reports/lab4.org
#+title: Lab2
#+PROPERTY: header-args:python   :session :exports both :eval no-export :async
* Lab 4: Chomsky normal form
- Course :: Formal Languages & Finite Automata
- Author :: Balan Artiom

* Theory
* Objectives
- [X] Implement a method to convert a CFG to its normal form
* Results
#+begin_src python :exports none
from angryowl.grammar import *
#+end_src

#+RESULTS:

Here's the grammar from variant #3,
#+begin_src python :results drawer
g1 = Grammar(VN = {'S', 'A', 'B', 'C', 'E'},
        VT = {'d', 'a'},
        S = 'S',
        P = {
            ('S',): {('A',)},
            ('A',): {('d',), ('d', 'S'), ('a', 'A', 'd', 'A', 'B')},
            ('B',): {('a', 'C'), ('a', 'S'), ('A', 'C')},
            ('C',): {()},
            ('E',): {('A', 'S')}})

"$$" + g1.to_latex() + '$$'
#+end_src

#+RESULTS:
:results:
$$\\begin{align}S &→ A \\\\ A &→ d | a A d A B | d S \\\\ B &→ A C | a C | a S \\\\ C &→ ε \\\\ E &→ A S\\end{align}$$
:end:

And here's its Chomsky normal form:
#+begin_src python :results drawer
g1_normal = g1.to_normal_form()

"$$" + g1_normal.to_latex() + '$$'
#+end_src

#+RESULTS:
:results:
$$\\begin{align}S &→ d0 S | a0 A0 | d \\\\ A &→ d0 S | a0 A0 | d \\\\ B &→ a | d0 S | a0 A0 | a0 S | d \\\\ E &→ A S \\\\ S0 &→ d0 S | a0 A0 | d \\\\ d0 &→ d \\\\ a0 &→ a \\\\ A0 &→ A A1 \\\\ A1 &→ d0 A2 \\\\ A2 &→ A B\\end{align}$$
:end:

#+begin_src python :results verbatim
g1
#+end_src

#+RESULTS:
: {S -> A, A -> d, A -> a A d A B, A -> d S, B -> A C, B -> a C, B -> a S, C -> , E -> A S}

#+begin_src python :results verbatim
from copy import deepcopy
g2 = deepcopy(g1)
g2._START()
g2._TERM()
g2._BIN()
g2._DEL()
g2._UNIT()

g2
#+end_src

#+RESULTS:
: {S -> d0 S, S -> a0 A0, S -> d, A -> d0 S, A -> a0 A0, A -> d, B -> a, B -> d0 S, B -> a0 A0, B -> a0 S, B -> d, E -> A S, S0 -> d0 S, S0 -> a0 A0, S0 -> d, d0 -> d, a0 -> a, A0 -> A A1, A1 -> d0 A2, A2 -> A B}

* Implementation
